Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_enforcement/index.html.txt.tmx
Source language: en
Languages: ga

source: Garda Síochána - national police force
ga: An Garda Síochána - fórsa póilíneachta náisiúnta

source: The Garda Síochána is the national police force
ga: Is é an Garda Síochána fórsa póilíneachta náisiúnta na hÉireann

source: It has responsibility for carrying out all policing duties in the State
ga: Tá sé freagrach as dualgais uile na póilíneachta a fheidhmiú i Stát na hÉireann

source: Garda Síochána Ombudsman Commission
ga: Coimisiún Ombudsman an Gharda Síochána

source: The Garda Síochána Ombudsman Commission or Garda Ombudsman is an independent agency that deals with complaints from the public about members of the Gardaí
ga: Is iad Coimisiún Ombudsman an Gharda Síochána (COGS) nó Ombudsman na nGardaí an ghníomhaireacht neamhspleách a dhéileálann le gearáin ón bpobal mór faoi bhaill den Gharda Síochána

source: If you are a victim of a crime you should contact the Gardai
ga: Más íospairt coireachta tú ba chóir duit teagmháil a dhéanamh leis na Gardaí

source: Find out how to report a crime
ga: Faigh amach conas coir a thuairisciú

source: Crowd control at public events in Ireland
ga: Rialú sluaite ag imeachtaí poiblí in Éirinn

source: There are laws in place designed to give the Gardai (Irish police force) clear and comprehensive legal powers to deal with crowd control
ga: Tá dlíthe i bhfeidhm a dearadh chun cumhachtaí dlíthiúla soiléire cuimsitheacha a thabhairt do na Gardaí (fórsa póilíní na hÉireann) chun cur ar a gcumas déileáil le rialú sluaite

source: Anti-social behaviour by adults
ga: Iompar frithshóisialta daoine fásta

source: The Criminal Justice Act 2006 has provisions dealing with anti-social behaviour by adults
ga: Tá forálacha san Acht um Cheartas Coiriúil 2006 chun déileáil le hiompar frithshóisialta déanta ag daoine fásta

source: These provisions allow gardaí to deal with anti-social behaviour through a civil process using behaviour warnings and orders or ASBOs
ga: Cuireann na forálacha seo ar chumas na ngardaí déileáil le hiompar frithshóisialta déanta ag daoine fásta trí mheán próiseas sibhialta a úsáideann rabhaidh agus orduithe iompair nó a bhaineann le horduithe um iompar frithshóisialta

source: Public order offences and powers of arrest
ga: Cionta in aghaidh oird phoiblí agus cumhachtaí gabhála

source: The Gardaí have the powers to arrest without warrant people guilty of certain public order offences
ga: Tá cumhacht ag comhaltaí den Gharda Síochána daoine a ghabháil gan bharántas má tá siad ciontach as cionta áirithe in aghaidh an oird phoiblí

source: The Adult Cautioning Scheme can be an alternative to prosecution for certain offences where a caution is considered to be in the public interest
ga: Féadtar an Scéim um Rabhadh Aosach a úsáid mar rogha eile in áit ionchúisimh as cionta áirithe áit a mheastar go mbaineann rabhadh le leas an phobail

source: The courts can impose restrictions on the movements of those convicted of some minor offences as an alternative to imposing a custodial sentence
ga: Is féidir leis na cúirteanna srianta a ghearradh ar ghluaiseachtaí daoine a ciontaíodh as mionchionta mar mhalairt ar phianbhreith choimeádta a ghearradh

source: Find out when they are used here
ga: Faigh amach anseo cá huair a úsáidtear iad

source: Monitoring sex offenders in Ireland
ga: Ag déanamh monatóireachta ar chiontóirí gnéis in Éirinn

source: The supervision of sex offenders following release from prison is provided for by the Sex Offenders Act 2001
ga: Foráiltear ar son maoirseacht a dhéanamh ar chiontóirí gnéis i ndiaidh a scaoilte as príosún san Acht um Chiontóirí Gnéis 2001

source: Find out more here
ga: Foghlaim níos mó anseo

source: The courts can impose extra restrictions on a sex offender following release from prison if it is felt the sex offender may pose a serious threat to the public
ga: Is féidir leis na cúirteanna srianta breise a ghearradh ar chiontóir gnéis i ndiaidh a scaoilte saor ón bpríosún

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
